# PipingVolume Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpecTypeId..::..PipingVolume Property
SpecTypeId Class See Also
---
Volume, in discipline Piping.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId PipingVolume { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PipingVolume As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PipingVolume {
	ForgeTypeId^ get ();
}
```

# See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace